package com.example.java;


/**
 *  java 面向对象的三条主线
 *      ① 学习类及类的成员，包括属性，方法，构造器，代码块，内部类
 *      ② 面向对象的三大特征: 封装，继承，多态，(抽象)
 *      ③ 其他关键字的使用：this,super,static,final,package,interface 等
 *
 * 著名实例： 人把大象装进冰箱
 *
 *      面向过程的解决方式: 强调的是功能行为，以函数为单位，考虑怎么做 --》》 类似于 劳动者
 *          ① 把冰箱门打开
 *          ② 把大象放进冰箱
 *          ③ 关上冰箱门
 *
 *      面向过程的解决方式：强调具备功能的对象，以类/对象为单位，考虑让谁来做 --》》 类似于指挥者
 *         人{
 * 		    打开(冰箱){
 * 			冰箱.开开();
 * 		}
 *
 * 		抬起(大象){
 * 			大象.进入(冰箱);
 * 		}
 *
 * 		关闭(冰箱){
 * 			冰箱.闭合();
 * 		}
 *
 *  }
 *
 *
 * 冰箱{
 * 		开开(){}
 * 		闭合(){}
 * }
 *
 * 大象{
 * 		进入(冰箱){
 * 		}
 * }
 *
 *
 *   面向对象的两个重要因素
 *      类：抽象的，概念性的东西，是对一类事务的描述
 *      对象：具体的，实际的，是某个类的具体示例
 *
 *     面向对象的程序设计重点就是类的设计，而类的设计就是设计的类的成员
 *
 */

public class OOPTest {



}
